# Introduction to Pandas DataFrames

*Pandas is a powerful and versatile library for Python, designed primarily for data manipulation and analysis.*  
> Pandas is the most popular software library for data manipulation and data analysis for the Python programming language. (www.nvidia.com)

## Key functionalities in Pandas

1. **Data Structures**  
   - Series: ...
   - DataFrame: ...
2. **Data Manipulation**  
   - Data Selection and Indexing (`.loc`, `.iloc`, `.at`, `.iat`)
   - Filtering
   - Sorting
   - Handling Missing Data (`isnull`, `dropna`, `fillna`)

In [1]:
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
df      # statt print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [8]:
data = [
    ['Alice', 25, 'New York'],
    ['Bob', 30, 'Los Angeles'],
    ['Charlie', 35, 'Chicago']
]
df = pd.DataFrame(data, columns=['Name', 'Age', 'City'])
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [9]:
df['Name']

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [11]:
df.iloc[0]

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [12]:
df.loc[0, 'Name']

'Alice'

## Further resources on Pandas

| Resource                  | Description                                      |
| ------------------------- | ------------------------------------------------ |
| [Pandas Documentation](https://pandas.pydata.org/) | Official documentation for Pandas. |
| *Python for Data Analysis* | Comprehensive guide by Wes McKinney. |
| Real Python: The Pandas DataFrame | Tutorials on using Pandas for data analysis. |
| Kaggle Pandas            | Free introductory course on Pandas. |
| DataCamp Pandas Tutorial | Detailed tutorials and exercises on Pandas. |

![Pandas logo](Pandas.webp)